{
    "python": "Used Python to design server applications and client interfaces in the role of Software Engineer(Backend Developer) at NUS CommIT.",
    "java": "Not explicitly demonstrated in the text.",
    "sql": "Studied industrial application of SQL database use cases and it's deployment in the role of Full Stack Developer at ST Engineering. Utilized SQL database in the role of Software Engineer(Backend Developer) at NUS CommIT.",
    "javascript": "Handled development and management of frontend user interfaces with the help of HTML, CSS, and Javascript in the role of Software Engineer(Backend Developer) at NUS CommIT.",
    "html": "Handled development and management of frontend user interfaces with the help of HTML, CSS, and Javascript in the role of Software Engineer(Backend Developer) at NUS CommIT.",
    "css": "Handled development and management of frontend user interfaces with the help of HTML, CSS, and Javascript in the role of Software Engineer(Backend Developer) at NUS CommIT.",
    "pytorch": "Not explicitly demonstrated in the text.",
    "numpy": "Not explicitly demonstrated in the text.",
    "django": "Utilized Python, Django, Djoser etc. to design server applications and client interfaces in the role of Software Engineer(Backend Developer) at NUS CommIT.",
    "postgresql": "Not explicitly demonstrated in the text.",
    "react & react native": "Designed, developed, tested and deployed mobile applications using React Native, Firebase and cloud firestore in the role of Full Stack Engineer at Orbital.",
    "node.js": "Not explicitly demonstrated in the text.",
    "sklearn": "Not explicitly demonstrated in the text.",
    "firebase": "Implemented Google Firebase Cloud Firestore and Authentication to provide database and authentication services to application in the role of Full Stack Engineer at Orbital.",
    "excel": "Not explicitly demonstrated in the text.",
    "mongodb": "Not explicitly demonstrated in the text.",
    "linux/unix administration": "Not explicitly demonstrated in the text.",
    "r": "Not explicitly demonstrated in the text.",
    "azure open ai": "Integrating GPT powered by Azure Open AI endpoints in the current pipeline to perform parsing of PDF documents in the role of AI Developer at SAP.",
    "gpt prompting, embeddings, spacy": "Utilized different prompting techniques such as RAG and chain of thought to minimize AI hallucinations in the role of AI Developer at SAP.",
    "apache airflow": "Extract, transform, and ingest real estate data from different sources and create workflows on Apache Airflow in the role of Data Engineer Intern at Real Estate Analytics.",
    "dbt, aws": "Collaborated with data engineers in building efficient data pipelines using DBT, AWS etc. in the role of Data Engineer Intern at Real Estate Analytics.",
    "c#, .net libraries": "Implemented OSI Network Layer influenced Serial Protocol using C# and .Net libraries in the role of Full Stack Developer at ST Engineering.",
    "lucid chart, uml diagrams": "Designed Backend Architecture using UML Diagrams on Lucid Chart in the role of Full Stack Developer at ST Engineering.",
    "wpf": "Connected Backend architecture with User interface with C# and WPF in the role of Full Stack Developer at ST Engineering."
}